{
  "About Me": {
    "thumbnail": {
      "title": "About Me",
      "description": "This blog is about me and my story",
      "image": "/uploads/1765655991080-image6.jpg"
    },
    "heading": "About Me",
    "date": "13.12.2025",
    "author": "Anne",
    "mainText": "<p class=\"ql-align-center\"><strong style=\"background-color: transparent; color: black;\">In the summer of 2025, the Lord placed it on my heart to start a blog. And here we are.</strong></p><p class=\"ql-align-center\"><span style=\"background-color: transparent; color: black;\"> I’m so excited to share with you what God is doing in my life and heart. The season Jesus is leading me through is one of restoration and the renewing of the mind. This blog is meant to give you a glimpse into how I’m walking through this season—and how to live as a disciple of Jesus and a daughter of God.</span></p><p class=\"ql-align-center\"><span style=\"background-color: transparent; color: black;\">The name is a pun between </span><em style=\"background-color: transparent; color: black;\">Always in Faith</em><span style=\"background-color: transparent; color: black;\"> and </span><em style=\"background-color: transparent; color: black;\">A-L’s Ways in Faith</em><span style=\"background-color: transparent; color: black;\">. My desire is to encourage you by showing </span><em style=\"background-color: transparent; color: black;\">my</em><span style=\"background-color: transparent; color: black;\"> ways in faith so that </span><em style=\"background-color: transparent; color: black;\">you</em><span style=\"background-color: transparent; color: black;\"> can remain always in faith. Regardless of what life, the devil, or others may bring your way.</span></p><p class=\"ql-align-center\"><span style=\"background-color: transparent; color: black;\">But first, let me tell you a bit more about myself.</span></p><p class=\"ql-align-center\"><span style=\"background-color: transparent; color: black;\">I’m a 21-year-old student at Awakening School of Ministry (School Year 2025/26). I’m Dutch and lived in the Netherlands my whole life, until last year. My favorite animals are pigs, and just like a little girl, you can always make me smile by showing me a photo or video of one ;)</span></p><p class=\"ql-align-center\"><span style=\"background-color: transparent; color: black;\"> I love spending time with friends, visiting beautiful places, and seeking adventure. One of my favorite things to do is travel and explore nature, especially the (Swiss) mountains. Thank God He called me to live in Germany, just ten minutes from the Swiss border, close to the beautiful Alps!</span></p><p class=\"ql-align-center\"><span style=\"background-color: transparent; color: black;\">But long story short, my life hasn’t always been this close to God. In fact, until I was 18 or 19, I didn’t want much to do with Him or the Christian faith. Most of my life, I actually felt resistant towards it.</span></p><p><br></p><p class=\"ql-align-center\"><span style=\"background-color: transparent; color: black;\">I grew up in a beautiful Christian family, with my parents, two sisters and a brother. We were members of a religious church in our village and (almost) never missed a Sunday.</span></p><p class=\"ql-align-center\"><span style=\"background-color: transparent; color: black;\">Growing up in that church environment meant growing up surrounded by rules and traditions. This was especially apparent when I compared it to the lifestyles of my classmates and their families.</span></p><p class=\"ql-align-center\"><span style=\"background-color: transparent; color: black;\"> So maybe I didn’t hate God so much, but struggled more with the traditions and rules that were placed around Him. That’s why, for most of my life, I wasn’t really interested in getting to know Him, let alone living with Him.</span></p><p class=\"ql-align-center\"><span style=\"background-color: transparent; color: black;\">Until 2023.</span></p><p class=\"ql-align-center\"><span style=\"background-color: transparent; color: black;\"> He entered my life in a way I never expected. That year, I was struggling with a deep depression. My life felt like it was worthless and empty.</span></p><p class=\"ql-align-center\"><span style=\"background-color: transparent; color: black;\">To cut a long story short, I decided to get baptised on a whim after realising that my life was heading in the wrong direction. I thought it would be worth taking one step towards God to see what would happen.</span></p><p class=\"ql-align-center\"><span style=\"background-color: transparent; color: black;\">And something </span><em style=\"background-color: transparent; color: black;\">did</em><span style=\"background-color: transparent; color: black;\"> happen.</span></p><p class=\"ql-align-center\"><span style=\"background-color: transparent; color: black;\">The next morning, I woke up completely different than any morning ever before. I woke up happy, with a heart full of joy, peace, and hope, something I had never felt so strongly.&nbsp; &nbsp; &nbsp; The heaviness and pain in my heart were completely gone…</span></p><p><br></p><p class=\"ql-align-center\"><span style=\"background-color: transparent; color: black;\">Over the following two years, after that first encounter with God, He took me on a journey of getting to know Him, discovering my new identity in Christ, and walking as a disciple of Jesus.</span></p><p class=\"ql-align-center\"><span style=\"background-color: transparent; color: black;\"> I moved to Germany to attend the Awakening School of Ministry, and apart from my baptism, it was the most transformative year of my life.</span></p><p class=\"ql-align-center\"><span style=\"background-color: transparent; color: black;\">I saw God and His glory in new ways. He brought me deeper into both His identity and mine. And now, I am forever His.</span></p><p class=\"ql-align-center\"><span style=\"background-color: transparent; color: black;\"> The Lord set me free from so many things that year and began a process of restoration in my heart. That process continued over the summer after I finished the school program, and during that summer, I heard the call of God:</span></p><p class=\"ql-align-center\"><span style=\"background-color: transparent; color: black;\">“Anne, I want you to do the school again.”</span></p><p class=\"ql-align-center\"><span style=\"background-color: transparent; color: black;\">So, here I am.</span></p><p class=\"ql-align-center\"><span style=\"background-color: transparent; color: black;\"> Still living in Germany. Still attending the Awakening School of Ministry (ASM), now for the second time. And now sharing glimpses of my walk with God through these blogs.</span></p><p class=\"ql-align-center\"><span style=\"background-color: transparent; color: black;\">God and His glory are transforming my life and I am so excited to share glimpses of it with you. I hope you will be deeply impacted by God through what you read on this site. It's not for me, it is for you to meet Him on these pages.</span></p>"
  },
  "His presence with us": {
    "heading": "His presence with us",
    "thumbnail": {
      "title": "His presence with us",
      "description": "God’s deep desire: dwell with humanity through Jesus.",
      "image": "/uploads/1765656638441-image7.jpg"
    },
    "date": "13.12.2025",
    "author": "Anneeeee",
    "mainText": "<p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Did you know that it is one of God's deepest desires to be with us? That you are wanted in His presence and that it is His greatest joy to be reunited with us through the offer of Jesus? It has been for me a life-changing revelation after God took me on this journey through the Old Testament into the New Testament to show His desire to be among and close to His people. I want to take you with me on this journey to show you what He showed me.&nbsp;</span></p><p><br></p><p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">This journey starts at the very beginning in Genesis. The creation of humanity, the garden, and the surrounding context. Genesis 1 and 2 describe how God created the world, and in this world, a garden. He created a perfect environment for humans to live in. A garden filled with an abundance of food, trees and fruit was the perfect place to find perfect peace and fulfilment. After creating the whole environment, God created humanity itself. Adam and Eve were planted in the garden, and as we read in Gen. 3:8, God walked with them in the garden. It was a place of perfect community, fellowship, and full of life. This was the setting and environment that God created humanity in. This was His desire, to see His people living in a beautiful home and to live with them in that place.&nbsp;</span></p><p><br></p><p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">True love is a choice: the choice to love, and the commitment to that choice. And in God's perfect love, He gave Adam and Eve a choice. A choice to choose for Him, to love Him, and to commit to Him. God planted a tree in the middle of the garden and told Adam and Eve not to eat its fruit, because if they did, they would die. This tree is the picture of the free will that mankind has, even still today. We all know that Adam and Eve got deceived by the serpent and ended up eating from the tree. They chose against God's desire, and something broke in that moment. It is shown right after we read about Adam and Eve eating from the tree in Genesis 3, they hid from God. The disconnection from God is the immediate effect of their disobedience to God. Their sin is followed by a disconnection from God, as we read that God is asking where Adam is. God's first reaction after sin is to seek His creation, but His creation is turned away. Hidden in the garden, Adam and Eve are ashamed of their sin and nakedness.&nbsp;</span></p><p><br></p><p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">After God finds Adam and Eve and explains the effect of their poor decision, He takes them out of the garden. Not as punishment but again as an act of love. God wants to restore the original relationship, but He knows that if Adam in his fallen state would eat from the other tree in the garden, the tree of life, Adam would live forever in his fallen state. And that fallen state, the sinful nature of God, was the very reason God couldn't be close anymore to His people. Sin and a holy God cannot go together.&nbsp;</span></p><p><br></p><p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">After God showed me this story, He led me further through the Old Testament. He showed me Moses in the desert. After He led the Israelites out of Egypt, God met Him at Mount Sinai. God invites the Israelites into a covenant. As stated in Exodus 19, He says, \"</span><em style=\"background-color: transparent; color: rgb(0, 0, 0);\">Now therefore, if you will indeed obey My voice and keep My covenant, you shall be My treasured possession among all people, for all the earth is mine; and you shall be to Me a kingdom of priests and a holy nation.</em><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">\" God invites the people of Israel to become His own people. But, He says, in order to be His people, they have to follow His voice and commandments. In the following chapters after this invitation, we read what these commandments exactly are. The law is given to Moses, and in this law, we find clear instructions for a tabernacle.&nbsp;</span></p><p><br></p><p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">This tabernacle wasn't in the first place given for the people to have a place of sacrifices. The word \"tabernacle\" means \"dwelling place.\" It was a place given to the people of Israel for God to dwell. His desire to be among His people is shown again. Something that impacted me was the fact that the law wasn't just a list of strict rules to follow, that if disobeyed, God would be in anger and punish them. The law was a framework and boundary for the people to live according to God's will and holiness, so that it was possible for Him to live among them. It was an invitation into His nature and holiness, into His presence.</span></p><p><br></p><p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Moses followed God's instruction for the building of this tabernacle, and when finished, something remarkable happened. We can read it in Exodus 40. In verses 33 and 34, we read, \"</span><em style=\"background-color: transparent; color: rgb(0, 0, 0);\">So Moses finished the work (the tabernacle). Then the cloud covered the tent of meeting, and the glory of the LORD filled the tabernacle.</em><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">\" God found His place with people again.</span></p><p><br></p><p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">We fast forward again, and the history goes on. David gets anointed as king and has a desire in his heart to build God a house instead of a tent, a tabernacle. Eventually, his son Solomon follows up on this and receives from God the instructions to build Him a house, a temple. Solomon obeys God's instructions and finishes the building of this temple. We read in 1 Kings 8:10 and 11 the following: \"</span><em style=\"background-color: transparent; color: rgb(0, 0, 0);\">And it came to pass, when the priests were come out of the holy place, the cloud filled the house of the LORD, so that the priests could not stand to minister because the LORD had filled the house of the LORD.</em><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">\" The same cloud of glory as with Moses filled the temple in Jerusalem, and God continued to live with His people in Israel.&nbsp;</span></p><p><br></p><p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">But this still wasn't the restoration of the very thing that broke in the Garden of Eden. It was rather a solution until that disconnection could be restored again, then the full restoration. God promised Eve that her offspring would crush the serpent's heel. This offspring would destroy the serpent — the devil — who had deceived them into sin. And with the tabernacle and temple, that hadn't happened yet. At the start of the New Testament, we read about a child being promised, and in Matthew 1:23 it is written that His name will be Immanuel, as the prophet Isaiah in the Old Testament already prophesied. This child was the seed of Eve, the one that came to crush the heel of the serpent. And His name was Immanuel, God with us.&nbsp;</span></p><p><br></p><p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Jesus came to this earth for this very reason. To bring back the relationship that we found earlier in the garden between men and God. To restore that which was broken in Genesis 3. Jesus lived the perfect life in obedience to God, and in Jesus, no sin was found. And still, He had to die. Even though Jesus didn't have the sinful nature of humanity, He still took our iniquities and sin upon Himself and obeyed God unto the cross. His sacrifice at the cross was to deal with the sin of men that they had lived in since the fall. Jesus did what the law couldn't do. He took away the sin. Jesus died for our sins at the cross, and at the moment He gave His last breath at the cross, something happened. The veil in the temple, which separated the Holy Place from the Holy of Holies, the place where God's presence dwelt, tore in two. The way into the Holy of Holies, into the presence of God, was open for all.&nbsp;</span></p><p><br></p><p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">The sinful nature that brought separation between men and God was dealt with. It died in Jesus at the cross. The book of Romans teaches us that when we put our faith in Jesus and His offer at the cross, we can become one with Him. Through baptism we become one with His death and resurrection, as Romans 6:5 states: \"</span><em style=\"background-color: transparent; color: rgb(0, 0, 0);\">For if we have been united together in the likeness of His death, certainly we also shall be in the likeness of His resurrection</em><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">.\" In this moment, a transaction takes place. We trade our sinful nature for a new nature from God. 2 Corinthians 5:17 gives a clear explanation of this transformation. </span><em style=\"background-color: transparent; color: rgb(0, 0, 0);\">\"Therefore, if anyone is in Christ, he is a new creation; old things have passed away; behold, all things have become new.\"</em></p><p><br></p><p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">There is something special about this new creation. In this new creation, a dwelling place is found. After the gospels, when Jesus ascended to heaven, He sent the Holy Spirit to the world, first to His disciples, but as we can read in the book of Acts, it was available for all mankind. Paul writes about this in Corinthians, the Holy Spirit within man. He writes in 1 Corinthians 3:16, \"</span><em style=\"background-color: transparent; color: rgb(0, 0, 0);\">Do you not know that you are the temple of God and that the Spirit of God dwells in you?</em><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">\" This new creation is a temple for God's Spirit to dwell in. This word 'temple' is the same that the Bible uses for the temple in Jerusalem, the parts of the Holy Place and the Holy of Holies. Our hearts are a copy of these places, now restored into being a dwelling place for God's Spirit. His presence isn't found anymore in temples of stone. His presence is found in temples of flesh. God is with us.&nbsp;</span></p><p><br></p><p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Remember that when God's Spirit and glory filled the temple in Jerusalem, in 1 Kings 8, the priests weren't even able to minister anymore because of the presence of God! This same presence is now found within us! Doesn't that change your perspective on how you view the availability and nearness of God's presence? His presence doesn't seem far away anymore and It isn't hard to enter into! It is found right in our hearts, always within us. We are never disconnected anymore from His presence, and wherever we go, His presence will be with us (Psalm 139). So even when you go into your secret place, you don't have to wait half an hour until God arrives. He is already waiting for you to come into the secret place. He is present, and it is up to you how you respond to it.</span></p><p><br></p><p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">I want to encourage you for the next days. Remember this desire of God and the truth about His presence when you enter the secret place. Focus your mind on the truth of Him being already with you, waiting for you to turn your focus on His presence. Let's see how your life will be changed by the presence and glory of God within you! </span></p><p><br></p><p><br></p>"
  },
  "but behold, O Lord, You know it altogether_": {
    "thumbnail": {
      "title": "but behold, O Lord, You know it altogether.",
      "description": "Journey from doubt to faith through God’s presence.",
      "image": "/uploads/1765656995669-image4.jpg"
    },
    "heading": "but behold, O Lord, You know it altogether_",
    "date": "13.12.2025",
    "author": "AANNEE(:",
    "mainText": "<p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">We’re back in 2023. As you can read on the about me page, I struggled in a season in my life with a depression. It was the beginning of 2023, the winter months, and I was deep in a depression, questioning everything about life. During this season, I went through the darkest time of my life, and the meaning of life itself became my biggest question. Being on earth didn’t make the most sense to me. I had just stopped going to the church I grew up in. It was a season of searching for my own faith, if I even had any at the time.</span></p><p><br></p><p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Deep down, I always had the sense that God must be out there. I was aware of His presence around me. He existed. But the churches and Christians I knew didn’t reflect that same reality. They often contradicted each other, and it left me confused.</span></p><p><br></p><p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">There was one particular afternoon when I was riding my bicycle home, lost in thought, questioning the meaning of life. \"If God created all of us and was truly alive, how could it be that so many people lived in their own worlds without acknowledging Him?\" The reality of God’s existence suddenly felt far away. It didn’t make sense to me. If God was who my friend said He was, a good and loving Father, why did so many people live in the darkness I was experiencing?</span></p><p><br></p><p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">And beyond all that, how could it even be that we’re all living on this planet, and that some Being would be in a “heaven” above the earth? All I knew about what was above us were stars and the universe. If that’s what surrounds the earth, then where would heaven even be?</span></p><p><br></p><p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Suddenly, I realized what I was thinking about. I was shocked. I had been in church every Sunday my whole life. I grew up in it, and yet here I was, questioning the very core of it: His existence. And I couldn’t answer my own questions. Sure, I’d thought about the existence of God before, but never in my life had I come so close to giving up on it. I truly doubted everything. I was ashamed of my thoughts and didn’t tell anyone. I kept wondering, how had I gotten this far, this deep?</span></p><p><br></p><p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">That same week, on Sunday, I went with some friends to a church service. It turned out to be Baptism Sunday. Two people had decided to give their lives to Jesus. While the church made a call for more people to be baptized, I felt my heart beating faster. Was baptism something I could do?</span></p><p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">The church had received a prophetic word that five people would choose to be baptized that day. After the call, one more person stepped forward, and we went outside to the water tank. “No,” I thought, “If I ever want to do this, I can decide another time. I won’t do it today.”</span></p><p><br></p><p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">As we walked outside, I talked with my friends about the two people still “missing” to fulfill the prophecy. One of my friends had been thinking about baptism for a while, and we jokingly said, “Maybe we’re the last two.”</span></p><p><br></p><p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">The baptisms were beautiful, full of emotion. It was the first time I had ever seen adults get baptized. I had only known infant baptisms from my old church. This was something new. In the end, as people were getting baptized, two more stepped forward, and a weight lifted off my shoulders. I didn't need to think about if I wanted to do it. Watching the baptisms and the emotions on people’s faces moved me deeply. A family member of one of my friends spontaniously decided for Jesus and the baptism and it was a beautiful moment for their family. God was visibly at work. But that day, baptism wasn’t for me. Maybe in the future. But not yet.</span></p><p><br></p><p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">As we walked back to the church, my thoughts still swirling, one of my friends came alongside me and said, “After seeing this today, how can anyone still believe there’s no God?”</span></p><p><br></p><p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">My heart dropped. Stopped. Or skipped a beat. I don’t know exactly what happened, but I remember breaking down the moment she asked that question. It was me. I was the one struggling to believe. I was the one doubting God’s existence. And how could she know?</span></p><p><br></p><p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">She didn’t. But God did.</span></p><p><br></p><p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">God knows our hearts, and at that very moment, He knew exactly how to reach me.</span></p><p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">My friend saw the tears streaming down my face and asked what had touched me. I opened up about what had been on my mind the past few days. I shared that I had been thinking about getting baptized. She asked me,</span></p><p><br></p><blockquote><em style=\"background-color: transparent; color: rgb(0, 0, 0);\">“What’s holding you back from choosing Jesus and being baptized?”</em></blockquote><p><br></p><blockquote><em style=\"background-color: transparent; color: rgb(0, 0, 0);\">“I don’t know… doubts?”</em></blockquote><p><br></p><blockquote><em style=\"background-color: transparent; color: rgb(0, 0, 0);\">“What do you have to lose?”</em></blockquote><p><br></p><p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">What did I have to lose? What do you mean? My life? Not really. To be honest, I wasn’t very happy to be alive at that point. I guess I had nothing to lose. I saw that day that God must be real, and maybe, just maybe, this decision could help me figure out who He really was...</span></p><p><br></p><p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">…And it was that very baptism that set me free. Free from depression, suicidal thoughts, and all the heaviness I had lived with. That day and that decision led me to discover who God really is. He became my Savior. My Deliverer. My chain-breaker. The One who set me free and gave me my life back—fully, abundantly, and with overflowing joy.</span></p><p><br></p><p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">God knows our hearts. As David writes in </span><em style=\"background-color: transparent; color: rgb(0, 0, 0);\">Psalm 139:2–4</em><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">:</span></p><p><em style=\"background-color: transparent; color: rgb(0, 0, 0);\">You know my sitting down and my rising up;</em></p><p><em style=\"background-color: transparent; color: rgb(0, 0, 0);\">You understand my thought afar off.</em></p><p><em style=\"background-color: transparent; color: rgb(0, 0, 0);\">You comprehend my path and my lying down,</em></p><p><em style=\"background-color: transparent; color: rgb(0, 0, 0);\">And are acquainted with all my ways.</em></p><p><em style=\"background-color: transparent; color: rgb(0, 0, 0);\">For there is not a word on my tongue,</em></p><p><em style=\"background-color: transparent; color: rgb(0, 0, 0);\">But behold, O Lord, You know it altogether.</em></p><p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">He knows it all.</span></p><p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">And He knows how to reach you. He knows how to touch your heart. And He knows how to show you that He is alive.</span></p><p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">It's an invitation to trust in Him. He has the right answers and He knows the thoughts of your heart, your deepest questions and He is waiting for the moment to give you the right answers.</span></p><p><em style=\"background-color: transparent; color: rgb(0, 0, 0);\">But behold, O Lord, You know it altogether.</em></p><p><br></p><p><br></p><p class=\"ql-align-center\"><em style=\"color: rgb(0, 0, 0); background-color: white;\">--------------------------------------</em></p><p class=\"ql-align-center\"><span style=\"color: rgb(0, 0, 0); background-color: white;\">Luke 1:37 </span></p><p class=\"ql-align-center\"><br></p><p class=\"ql-align-center\"><em style=\"color: rgb(0, 0, 0); background-color: white;\">\"For with God nothing shall be impossible\"&nbsp;</em></p><p class=\"ql-align-center\"><br></p><p class=\"ql-align-center\"><em style=\"color: rgb(0, 0, 0); background-color: white;\">---------------------------------------------------------------------</em></p>"
  }
}